leetcode/30/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>30. Substring with Concatenation of All Words - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="leetcode" />
  <meta name="keywords" content="leetcode, ruby" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>30. Substring with Concatenation of All Words</h1>
            
<div id="outline-container-orga2c9b54" class="outline-2">
<h2 id="orga2c9b54">题目</h2>
<div class="outline-text-2" id="text-orga2c9b54">
<p>
<a href="https://leetcode.com/problems/substring-with-concatenation-of-all-words/">链接</a>
</p>

<p class="verse">
You are given a string, s, and a list of words, words, that are all of the same length. Find all starting indices of substring(s) in s that is a concatenation of each word in words exactly once and without any intervening characters.<br />
<br />
For example, given:<br />
s: "barfoothefoobarman"<br />
words: ["foo", "bar"]<br />
<br />
You should return the indices: [0,9].<br />
(order does not matter).<br />
</p>
</div>
</div>

<div id="outline-container-org70c13c7" class="outline-2">
<h2 id="org70c13c7">思路</h2>
</div>


<div id="outline-container-orgec9455a" class="outline-2">
<h2 id="orgec9455a">代码</h2>
<div class="outline-text-2" id="text-orgec9455a">
<div class="org-src-container">
<pre class="src src-ruby"># @param {String} s
# @param {String[]} words
# @return {Integer[]}
def find_substring(s, words)

end
</pre>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-10-16</span>
        <span title="last modification date" class="post-info">2016-10-18</span>
        <span title="tags" class="post-info"><a href="/tags/leetcode/">leetcode</a>, <a href="/tags/ruby/">ruby</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
